-- Seed data: dormitories
INSERT INTO dormitories (
  name,
  phone,
  water_fee,
  electricity_fee,
  monthly_rent,
  gender_type,
  room_type,
  image_url,
  location_id
) VALUES
  ('หอหรู', '0819705509', 25, 8, 3500, 'หอรวม', 'ห้องแอร์', NULL, NULL),
  ('หอปันปัน', '0918748623', 18, 5.8, 3000, 'หอรวม', 'ห้องแอร์', NULL, NULL),
  ('หอพรรณีเรสซิเดนซ์', '0965821223', 13, 7, 4000, 'หอรวม', 'ห้องแอร์', NULL, NULL),
  ('หอผึ้งหลวง', '0847918122', 22, 8, 3800, 'หอรวม', 'ห้องแอร์', NULL, NULL),
  ('หอป้ายา', '0863605998', 10, 4, 3500, 'หอรวม', 'ห้องแอร์', NULL, NULL),
  ('หอพักหญิงบ้านวรรณา', '0894013926', 20, 4, 3200, 'หอหญิง', 'ห้องแอร์', NULL, NULL),
  ('หอเพลินใจ', '0816465141', 10, 4, 3600, 'หอรวม', 'ห้องแอร์', NULL, NULL),
  ('หอนกฮูก', '0860053203', 23, 4, 3500, 'หอรวม', 'ห้องแอร์', NULL, NULL),
  ('หอแสงสุวรรณ', '0933293365', 22, 6, 3500, 'หอรวม', 'ห้องแอร์', NULL, NULL),
  ('หอพักตะเวนตะวัน', '0865184986', 20, 7, 3500, 'หอรวม', 'ห้องแอร์', NULL, NULL),
  ('หอเฌอลินน์', '0891692269', 20, 7, 3500, 'หอรวม', 'ห้องแอร์', NULL, NULL);
