-- Seed data: dormitories
INSERT INTO dormitories (
  name,
  phone,
  water_fee,
  electricity_fee,
  monthly_rent,
  gender_type,
  room_type,
  image_url,
  location_id
) VALUES
  ('หอหรู', '0819705509', 25, 8, 3500, 'หอรวม', 'ห้องแอร์', NULL, NULL),
  ('หอปันปัน', '0918748623', 18, 5.8, 3000, 'หอรวม', 'ห้องแอร์', NULL, NULL),
  ('หอพรรณีเรสซิเดนซ์', '0965821223', 13, 7, 4000, 'หอรวม', 'ห้องแอร์', NULL, NULL),
  ('หอผึ้งหลวง', '0847918122', 22, 8, 3800, 'หอรวม', 'ห้องแอร์', NULL, NULL),
  ('หอป้ายา', '0863605998', 10, 4, 3500, 'หอรวม', 'ห้องแอร์', NULL, NULL),
  ('หอพักหญิงบ้านวรรณา', '0894013926', 20, 4, 3200, 'หอหญิง', 'ห้องแอร์', NULL, NULL),
  ('หอเพลินใจ', '0816465141', 10, 4, 3600, 'หอรวม', 'ห้องแอร์', NULL, NULL),
  ('หอนกฮูก', '0860053203', 23, 4, 3500, 'หอรวม', 'ห้องแอร์', NULL, NULL),
  ('หอแสงสุวรรณ', '0933293365', 22, 6, 3500, 'หอรวม', 'ห้องแอร์', NULL, NULL),
  ('หอพักตะเวนตะวัน', '0865184986', 20, 7, 3500, 'หอรวม', 'ห้องแอร์', NULL, NULL),
  ('หอเฌอลินน์', '0891692269', 20, 7, 3500, 'หอรวม', 'ห้องแอร์', NULL, NULL),
  ('หอ THE ROOM', '0802809707', 21, 8, 3500, 'หอรวม', 'ห้องแอร์', NULL, NULL),
  ('หอพักพีพี', '0992652228', 20, 6, 4000, 'หอรวม', 'ห้องแอร์', NULL, NULL),
  ('หอปู', '0871529367', 20, 7, 3800, 'หอรวม', 'ห้องแอร์', NULL, NULL),
  ('หอ Trendy Wash', '0842893941', 20, 9, 3300, 'หอรวม', 'ห้องแอร์', NULL, NULL),
  ('หอศรีสุวรรณ', '0889244017', 20, 7, 3500, 'หอรวม', 'ห้องแอร์', NULL, NULL),
  ('หอพัก KC', '0917786354', 22, 8, 4000, 'หอรวม', 'ห้องแอร์', NULL, NULL),
  ('หอหลง', '0810833158', 17, 6, 4000, 'หอรวม', 'ห้องแอร์', NULL, NULL);
 

INSERT INTO amenities (	
  name,	
  slug,	
  category,	
  icon
) VALUES
  ('Wi-Fi','wifi','common','wifi'),
  ('เครื่องซักผ้า','washing_machine','common','washing-machine'),
  ('ห้ามเลี้ยงสัตว์', 'no_pets', 'policy', 'paw-print'),
  ('ที่จอดรถ','parking','common','car'),
  ('ทำอาหารได้','cooking_allowed','policy','chef-hat'),
  ('ที่ล้างจาน','dishwashing_area','common','sink'),
  ('ระบบรักษาความปลอดภัย','security_system','security','shield-check'),
  ('ตู้เสื้อผ้า','wardrobe','room','door-closed'),
  ('เตียง','bed','room','bed-double'),
  ('โต๊ะ','desk','room','table-2'),
  ('เก้าอี้','chair','room','armchair'),
  ('กล้องวงจรปิด','cctv','security','cctv'),
  ('อนุญาตให้เลี้ยงสัตว์', 'pets_allowed', 'policy', 'paw-print');

INSERT INTO dormitory_amenities (	
  dormitory_id,
  amenity_id
) VALUES
  (1,1),(1,2),(1,3),(1,4),(1,5),(1,6),(1,7),(1,8),(1,9),(1,10),(1,11),(1,12),
  (2,1),(2,2),(2,3),(2,4),(2,5),(2,6),(2,8),(2,9),(2,10),(2,11),(2,12),
  (3,1),(3,2),(3,3),(3,4),(3,5),(3,6),(3,7),(3,8),(3,9),(3,10),(3,11),(3,12),
  (4,1),(4,2),(4,3),(4,4),(4,5),(4,6),(4,7),(4,8),(4,9),(4,10),(4,11),(4,12),
  (5,1),(5,2),(5,3),(5,4),(5,5),(5,6),(5,8),(5,9),(5,10),(5,11),(5,12),
  (6,1),(6,2),(6,3),(6,4),(6,5),(6,6),(6,8),(6,9),(6,10),(6,11),(6,12),
  (7,1),(7,2),(7,3),(7,4),(7,5),(7,6),(7,8),(7,9),(7,10),(7,11),(7,12),
  (8,1),(8,2),(8,3),(8,4),(8,5),(8,6),(8,8),(8,9),(8,10),(8,11),(8,12),
  (9,1),(9,2),(9,3),(9,4),(9,5),(9,6),(9,8),(9,9),(9,10),(9,11),(9,12),
  (10,1),(10,2),(10,3),(10,4),(10,5),(10,6),(10,8),(10,9),(10,10),(10,11),(10,12),
  (11,1),(11,2),(11,3),(11,4),(11,5),(11,6),(11,8),(11,9),(11,10),(11,11),(11,12),
  (12,1),(12,2),(12,3),(12,4),(12,5),(12,6),(12,8),(12,9),(12,10),(12,11),(12,12),
  (13,1),(13,2),(13,3),(13,4),(13,5),(13,6),(13,8),(13,9),(13,10),(13,11),(13,12),
  (14,1),(14,2),(14,3),(14,4),(14,5),(14,6),(14,8),(14,9),(14,10),(14,11),(14,12),
  (15,1),(15,2),(15,3),(5,4),(15,5),(15,6),(15,8),(15,9),(15,10),(15,11),(15,12),
  (16,1),(16,2),(16,3),(16,4),(16,5),(16,6),(16,8),(16,9),(16,10),(16,11),(16,12),
  (17,1),(17,2),(17,3),(17,4),(17,5),(17,6),(17,8),(17,9),(17,10),(17,11),(17,12),
  (18,1),(18,2),(18,3),(18,4),(18,5),(18,6),(18,8),(18,9),(18,10),(18,11),(18,12);


  
